var app = {};




app.init = function(e)
{
	var that = this;
	this.data = false;
	this.mode = false;

	this.data_krr = {"ЦЕНТРАЛЬНЫЙ ФО":[["Белгородская область",161,79],["Брянская область",167,82],["Владимирская область",121,59],["Воронежская область",207,101],["Ивановская область",159,78],["Тверская область",176,86],["Калужская область",152,74],["Костромская область",98,48],["Курская область",109,53],["Липецкая область",115,56],["г. Москва",1473,722],["Московская область",786,385],["Орловская область",131,64],["Рязанская область",147,72],["Смоленская область",120,59],["Тамбовская область",107,52],["Тульская область",233,114],["Ярославская область",246,121]],"СЕВЕРО-ЗАПАДНЫЙ ФО":[["Архангельская область",165,81],["Вологодская область",134,66],["Калининградская область",113,55],["г. Санкт-Петербург",598,293],["Ленинградская область",150,73],["Мурманская область",96,47],["Новгородская область",90,44],["Псковская область",94,46],["Республика Карелия",87,43],["Республика Коми",86,42]],"ЮЖНЫЙ ФО":[["Краснодарский край",645,316],["Астраханская область",150,73],["Волгоградская область",298,146],["Ростовская область",339,166],["Республика Адыгея",51,25],["Республика Калмыкия",24,12],["Ставропольский край",277,136],["Республика Ингушетия",36,18],["Республика Дагестан",76,37],["Респ. Кабардино-Балкария",56,27],["Респ. Северная Осетия",46,23],["Респ. Карачаево-Черкесия",19,9],["Республика Чечня",32,16],["Республика Крым",140,69],["Город Cевастополь",55,27]],"ПРИВОЛЖСКИЙ ФО":[["Нижегородская область",427,209],["Кировская область",253,124],["Самарская область",382,187],["Оренбургская область",246,121],["Пензенская область",234,115],["Пермский край",202,99],["Саратовская область",345,169],["Ульяновская область",169,83],["Республика Башкортостан",429,210],["Республика Марий Эл",63,31],["Республика Мордовия",131,64],["Республика Татарстан",410,201],["Республика Удмуртия",196,96],["Республика Чувашия",86,42]],"УРАЛЬСКИЙ ФО":[["Ханты-Мансийский а.о.",151,74],["Ямало-Ненецкий а.о.",21,10],["Курганская область",126,62],["Свердловская область",512,251],["Тюменская обл. (без а.о.)",149,73],["Челябинская область",485,238]],"СИБИРСКИЙ ФО":[["Алтайский край",288,141],["Красноярский край",345,169],["Иркутская область",365,179],["Кемеровская область",175,86],["Новосибирская область",358,176],["Омская область",265,130],["Томская область",128,63],["Забайкальский край",70,34],["Республика Бурятия",50,24],["Республика Алтай",15,7],["Республика Тыва",11,5],["Республика Хакасия",72,35]],"ДАЛЬНЕВОСТОЧНЫЙ ФО":[["Приморский край",201,98],["Хабаровский край",151,74],["Амурская область",99,48],["Камчатский край",29,14],["Магаданская область",12,6],["Сахалинская область",56,27],["Чукотский авт.округ",7,3],["Республика Саха (Якутия)",99,48],["Еврейская авт. обл.",11,5]]};
	this.data_prgs = {"ЦЕНТРАЛЬНЫЙ ФО":[["Белгородская область",75,62,137],["Брянская область",94,175,268],["Владимирская область",88,129,217],["Воронежская область",135,111,246],["Ивановская область",31,35,67],["Тверская область",79,60,139],["Калужская область",79,74,153],["Костромская область",51,28,79],["Курская область",149,14,164],["Липецкая область",58,71,129],["г. Москва",254,563,817],["Московская область",324,160,484],["Орловская область",57,58,114],["Рязанская область",68,71,139],["Смоленская область",73,51,124],["Тамбовская область",95,23,119],["Тульская область",83,140,223],["Ярославская область",124,70,194]],"СЕВЕРО-ЗАПАДНЫЙ ФО":[["Архангельская область",81,50,131],["Вологодская область",53,29,82],["Калининградская область",68,50,118],["г. Санкт-Петербург",277,174,451],["Ленинградская область",67,49,115],["Мурманская область",26,42,68],["Новгородская область",40,46,86],["Псковская область",39,57,95],["Республика Карелия",35,33,68],["Республика Коми",42,36,78]],"ЮЖНЫЙ ФО":[["Краснодарский край",238,265,503],["Астраханская область",52,40,92],["Волгоградская область",101,122,222],["Ростовская область",204,136,340],["Республика Адыгея",26,19,45],["Республика Калмыкия",12,8,20],["Ставропольский край",148,76,223],["Республика Ингушетия",13,10,22],["Республика Дагестан",80,26,106],["Респ. Кабардино-Балкария",48,3,50],["Респ. Северная Осетия",41,17,58],["Респ. Карачаево-Черкесия",15,5,21],["Республика Чечня",17,7,24],["Республика Крым",54,51,105],["Город Cевастополь",7,10,17]],"ПРИВОЛЖСКИЙ ФО":[["Нижегородская область",217,123,340],["Кировская область",75,89,164],["Самарская область",110,175,284],["Оренбургская область",120,41,161],["Пензенская область",71,52,123],["Пермский край",72,57,129],["Саратовская область",106,66,172],["Ульяновская область",73,37,110],["Республика Башкортостан",185,64,249],["Республика Марий Эл",17,7,24],["Республика Мордовия",76,29,105],["Республика Татарстан",139,110,249],["Республика Удмуртия",55,55,110],["Республика Чувашия",34,69,104]],"УРАЛЬСКИЙ ФО":[["Ханты-Мансийский а.о.",28,34,62],["Ямало-Ненецкий а.о.",11,11,22],["Курганская область",70,19,89],["Свердловская область",177,156,333],["Тюменская обл. (без а.о.)",49,41,90],["Челябинская область",121,167,288]],"СИБИРСКИЙ ФО":[["Алтайский край",84,77,161],["Красноярский край",256,49,304],["Иркутская область",127,131,257],["Кемеровская область",186,60,247],["Новосибирская область",159,138,297],["Омская область",94,98,192],["Томская область",38,42,80],["Забайкальский край",43,37,80],["Республика Бурятия",71,12,83],["Республика Алтай",5,4,9],["Республика Тыва",3,6,9],["Республика Хакасия",29,14,43]],"ДАЛЬНЕВОСТОЧНЫЙ ФО":[["Приморский край",117,64,181],["Хабаровский край",42,58,100],["Амурская область",37,17,54],["Камчатский край",7,14,22],["Магаданская область",5,9,14],["Сахалинская область",28,28,56],["Чукотский авт.округ",2,0,2],["Республика Саха (Якутия)",19,38,57],["Еврейская авт. обл.",9,6,15]]};

	
	e.add('00-slide', 'onAfterLoad', function () {
		$('#menu').removeClass('xclmHidden');	
		$('#menu>li').addClass('xclmHidden');	
		//$('.00-slide').removeClass('xclmHidden');		
		menu_slides('0');			
		$('.slide-menu').on('click touchstart', function(){
			console.log($(this).data('slide-menu'));
			menu_slides($(this).data('slide-menu'));
		});
	});

	e.add('02-slide', 'onAfterLoad', function () {
		menu_slides('1');

		that.mode = 'krr'
		that.data = that.data_krr;
		that.drawFO();
		that.drawReg();
		that.drawData();

	});		

	e.add('101-slide', 'onAfterLoad', function () {
		menu_slides('2');	
	});	

	e.add('102-slide', 'onAfterLoad', function() {
		that.mode = 'prgs';
		that.data = that.data_prgs;
		that.drawFO();
		that.drawReg();
		that.drawData();
	});		

	/**
	 * Заполняем список федеральных округов
	 */
	this.drawFO = function()
	{
		console.log('Draw federals');
		$('#fo_select').empty();
		for (var i in that.data)
			$('#fo_select').append($('<option value="'+i+'">'+i+'</option>'));

		$('#fo_select').off('change', that.drawReg).on('change', that.drawReg);
	}

	/**
	 * ВАЖНО ДЛЯ ЖЕНИ!
	 * Показывает нужное изображение. Для этого прячет все изображения/div с классом 
	 * graph и показывает то избражение у которого в параметре data-fo указано русское название федерального округа,
	 * например <img src="sadsadsa.png" class="graph" data-fo="ЦЕНТРАЛЬНЫЙ ФО" />
	 */
	this.showImage = function()
	{
		var currentFO = $('#fo_select').val();

		console.log('Show image with data-fo='+currentFO);

		$('.graph').addClass('xclmHidden');
		$('[data-fo="'+currentFO+'"]').removeClass('xclmHidden')
	}

	/**
	 * Обновляем список областей
	 */
	this.drawReg = function()
	{
		that.showImage();
		console.log('Draw regions');
		var currentFO = $('#fo_select').val();
		$('#reg_select').empty();

		for (var i=0; i<that.data[currentFO].length; i++)
		{
			$('#reg_select').append($('<option value="'+i+'">'+that.data[currentFO][i][0]+'</option>'));
		}

		that.drawData();

		$('#reg_select').off('change', that.drawData).on('change', that.drawData)
	}

	/**
	 * Отрисовываем значения для области
	 */
	this.drawData = function()
	{
		console.log('Draw data');
		var currentFO = $('#fo_select').val();
		var currentReg = $('#reg_select').val();
		var data = that.data[currentFO][currentReg];

		if (that.mode == 'krr')
		{
			$('#st4').text(data[1]);
			$('#potentia').text(data[2]);
		}
		else
		{
			console.log('Draw prgs')
			$('#st34').text(data[3]);
		}
	}



	
};







	function menu_slides(prev){

		var menu = prev;
		if(menu == '1') {
			$('#menu>li').addClass('xclmHidden');
			$('.00-slide').removeClass('xclmHidden');
			$('.02-slide').removeClass('xclmHidden');
			$('.04-slide').removeClass('xclmHidden');
			$('.10-slide').removeClass('xclmHidden');
			$('.20-slide').removeClass('xclmHidden');
			$('.22-slide').removeClass('xclmHidden');
			$('.24-slide').removeClass('xclmHidden');			
			$('.48-slide').removeClass('xclmHidden');
			$('.301-slide').removeClass('xclmHidden');
			$('.302-slide').removeClass('xclmHidden');			
			$('#menu').addClass('menu_1');
			$('#menu').removeClass('menu_2');									
			// $('.00-slide').addClass('xclmHidden');								

		} else if (menu == '2') {
			$('#menu>li').addClass('xclmHidden');							
			$('.00-slide').removeClass('xclmHidden');
			$('.101-slide').removeClass('xclmHidden');
			$('.105-slide').removeClass('xclmHidden');
			$('.112-slide').removeClass('xclmHidden');
			$('.118-slide').removeClass('xclmHidden');
			$('.48-slide').removeClass('xclmHidden');			
			$('.301-slide').removeClass('xclmHidden');
			$('.302-slide').removeClass('xclmHidden');	
			$('#menu').addClass('menu_2');
			$('#menu').removeClass('menu_1');								
		} else {
			$('#menu>li').addClass('xclmHidden');	
		}

	};